In [2]:
import pandas as pd 
df1 = pd.read_csv(r"C:\Users\SHOBHIT KUMAR\OneDrive\Desktop\class work.csv")
print(df1)

In [3]:
data={'Name':['shakti','shobhit','shivam','suryansh','vansh'],
      'Age':[18,20,14,16,17],
      'Class':['iot','ai','ccml','core','mechanical'],
      'Roll':[48,50,49,54,59]}
df=pd.DataFrame(data)
df.Name
print(df)

       Name  Age       Class  Roll
0    shakti   18         iot    48
1   shobhit   20          ai    50
2    shivam   14        ccml    49
3  suryansh   16        core    54
4     vansh   17  mechanical    59

In [4]:
df.head(2)

      Name  Age Class  Roll
0   shakti   18   iot    48
1  shobhit   20    ai    50

In [5]:
df.tail(3)

       Name  Age       Class  Roll
2    shivam   14        ccml    49
3  suryansh   16        core    54
4     vansh   17  mechanical    59

In [6]:
df.shape

(5, 4)

In [7]:
df.describe()

             Age       Roll
count   5.000000   5.000000
mean   17.000000  52.000000
std     2.236068   4.527693
min    14.000000  48.000000
25%    16.000000  49.000000
50%    17.000000  50.000000
75%    18.000000  54.000000
max    20.000000  59.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Class   5 non-null      object
 3   Roll    5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [9]:
df['Class'].nunique()

5